app/controllers/frientrips_controller.rb

  def index
    @plans = Plan.all
---
SELECT `plans`.* FROM `plans`

  def show
    @plans = Plan.find(params[:id])
---
SELECT  `plans`.* FROM `plans` WHERE `plans`.`id` = 0 LIMIT 1